{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Junie&#39;s Junction",
	"language": "en",
	"home_page_url": "https://notmyjunie.github.io/",
	"feed_url": "https://notmyjunie.github.io/feed/feed.json",
	"description": "This is the junction where Junie becames truenie &lt;3",
	"author": {
		"name": "notmyjunie",
		"url": "https://notmyjunie.github.io/about-me/"
	},
	"items": [
		{
			"id": "https://notmyjunie.github.io/blog/one-month-estrogen/",
			"url": "https://notmyjunie.github.io/blog/one-month-estrogen/",
			"title": "One month on HRT",
			"content_html": "<p>One month on HRT, completed. I couldn't believe this achievement if it was 6 months ago. There have been tons of development on me, physically and mentally, most of them being positive changes.</p>\n<p>I want to get into the glaringly obvious change after being on HRT for this long. Yeah, that's right, my bo- emotions, I can understand them very clearly and express them in a way everyone understands now. Although, I faced tons of mood swings for the past 2 weeks, but it's still better than feeling like an empty husk, a puppet, with a very foggy memory and no emotions.</p>\n<p>Next up, my breasts have gotten more sensitive and bigger than before. There is huge amounts of pain in the area. I've been thinking of getting some sort of bralette but that would mean putting an end to boymoding(which I want to avoid in the first place).</p>\n<h2 id=\"how-did-we-get-here\" tabindex=\"-1\">How did we get here? <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/one-month-estrogen/\">#</a></h2>\n<p>Discovering my gender was a piece of cake, I just woke up one day and decided to be a transgender girl. Just kidding, it's much more complicated than that. 6 years ago I was on the brinks of suicide, I had no male friends but I socialised with the girls better. I began questioning my true gender identity and whether I'm happy with living as a man until I'm old.</p>\n<p>Then it struck me that I never did fit in the conventional definition of a &quot;male&quot;. None of my close social circles includes a normal straight male. I've always tried distancing myself from those types of people since I get uncomfortable near them. I think at that point I just started reminiscing all the times I was happy with being &quot;a boy&quot; and it truly hit me I was never happy being one in the first place.</p>\n<p>I was always jealous of my sister, and when my younger sister was born I became ever so jealous. I don't want to be like this forever. I've never felt like following the norm, even if mum told me to, I don't want to obey, but I had to act like I'm a good child or my social status becomes an L.</p>\n<p>Acting.</p>\n<p>I've been acting as someone I'm not before my gender discovery. I have never felt like &quot;myself&quot; after starting school. I had to act in order to get through the day, every day of my life from then on just for me to exist. And I don't want it to stay that way and not be &quot;myself&quot; until I die. But now that I know I'm trans, I'm finally happy, with a clear conscious.</p>\n<p>Gender Dysphoria is such a horrible thing to be facing when I didn't even know what it is that I was facing. Everything felt like a hurdle because there's just one obstacle that I can't seem to get off of my mind. But now that I've been on HRT, I can finally be assured to be able to do everything with a clear mind.</p>\n<p>I don't know how to end this (?)rant(?)vent but I reach out to all my trans sisters, that you can make through this!!! Kick gender dysphoria in the ass!!! Don't listen to the haters!!! You can do this. Do this for your own sake.</p>\n<p>This is Junie, the girlboss, and owner of the site, signing off. Thank you.</p>\n",
			"date_published": "2024-08-14T00:00:00Z"
		}
		,
		{
			"id": "https://notmyjunie.github.io/blog/siteupdates/",
			"url": "https://notmyjunie.github.io/blog/siteupdates/",
			"title": "Another Site Overhaul",
			"content_html": "<h1 id=\"what-s-new\" tabindex=\"-1\">What's new? <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/siteupdates/\">#</a></h1>\n<p>First off, you may have noticed the updated font. I switched from using boring old Inter to Figtree. Hopefully this change makes the text more legible. I have added a light mode colour scheme for those who enjoy light mode for the site, it's really pink. I've also done some tweaking to some page links and added a footer now. Last but not least, the about page is much more filled now! That's all I've done to make this site much more alive.</p>\n",
			"date_published": "2024-07-24T00:00:00Z"
		}
		,
		{
			"id": "https://notmyjunie.github.io/blog/a-song-a-day/",
			"url": "https://notmyjunie.github.io/blog/a-song-a-day/",
			"title": "A Song A Day for 30 Days (or more)",
			"content_html": "<h1 id=\"introduction\" tabindex=\"-1\">Introduction <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h1>\n<p>Hi! I will be posting daily updates about songs that I have listened to here. These are all my personal preferences, so expect some recurring artists in here.</p>\n<h2 id=\"day-1-sewerslvt-her\" tabindex=\"-1\">Day 1, Sewerslvt - her <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-04-29)</p>\n<p>This is one of the most emotional songs by Sewerslvt. The lyrics were written by their late lover Angel. I love the build-up in the beginning before the drop but my most favorite part about this song is the climax. This song hits really hard in the feels with the context of the whole album and Sewerslvt's late girlfriend.</p>\n<p>Video link:</p>\n<p>https://www.youtube.com/watch?v=r5xjh7vF-HM</p>\n<h2 id=\"day-2-dazegxd-emotion-engine\" tabindex=\"-1\">Day 2, Dazegxd - Emotion Engine <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-04-30)</p>\n<p>Upbeat overall. Found this from Night Runners. Fits with the game's aesthetics. This is the ideal song to vibe to :)</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=eZXKCiUMRlc</p>\n<h2 id=\"day-3-guns-n-roses-november-rain\" tabindex=\"-1\">Day 3, Guns N' Roses - November Rain <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-05-01)</p>\n<p>Entire song is slow-paced up until the beginning of the guitar part. I love the lyrics in this song!</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=y6lfK3bH4z8</p>\n<h2 id=\"day-4-ice-cube-it-was-a-good-day\" tabindex=\"-1\">Day 4, Ice Cube - It Was A Good Day <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-05-02)</p>\n<p>I first listened to this on the GTA San Andreas car radio.</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=v_MZfpnCAYo</p>\n<h2 id=\"day-5-geniforturers-cum-junkie\" tabindex=\"-1\">Day 5, GENIFORTURERS - Cum Junkie <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-05-04)</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=zQsvEh_HSEE</p>\n<h2 id=\"day-6-10-a-surplus-of-songs-o\" tabindex=\"-1\">Day 6-10, a surplus of songs :O <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h2>\n<p>(2024-05-10)</p>\n<p>I am going to catch up with the missing days here and introduce a whole load of songs (6 in total). And also one by Cynthoni that's become my favorite &lt;3&gt;</p>\n<h3 id=\"mindvacy-dead-year\" tabindex=\"-1\">mindvacy - Dead Year <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=dF0zdvMJ1Zs</p>\n<h3 id=\"pisca-oyasumi-saido\" tabindex=\"-1\">Pisca - OYASUMI SAIDO <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=t33aIlC818U</p>\n<h3 id=\"mf-doom-one-beer\" tabindex=\"-1\">MF-DOOM - One Beer <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<p>The most recognisable DOOM song, good samples he took. RIP to such a good lyricist.</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=h69FSgua80A</p>\n<h3 id=\"machine-girl-because-i-m-young-arrogant-and-hate-everything-you-stand-for\" tabindex=\"-1\">Machine Girl - ...Because I'm Young Arrogant And Hate Everything You Stand For <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=Yds-GcabFAo</p>\n<h3 id=\"goreshit-o-er-the-flood\" tabindex=\"-1\">Goreshit - O'er The Flood <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=TKqBTF4hSvI</p>\n<h3 id=\"cynthoni-grinding-of-the-teeth\" tabindex=\"-1\">Cynthoni - Grinding of The Teeth <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h3>\n<h4 id=\"watch-my-skin-erupt-in-a-cynthoni-of-flames\" tabindex=\"-1\">WATCH MY SKIN ERUPT IN A CYNTHONI OF FLAMES <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/a-song-a-day/\">#</a></h4>\n<p>I'm soooo fucking glad Sewerslvt came back for more music. This sudden comeback has given me fresh motivation to do stuff now. I want to say more here but I just can't seem to put it into words. After 3 years of absence, I've only ever thought that their final album release was the end. I'm so excited now and looking forward to all of their new releases.</p>\n<p>Song link:</p>\n<p>https://www.youtube.com/watch?v=ELa4CeijxHg</p>\n",
			"date_published": "2024-04-29T00:00:00Z"
		}
		,
		{
			"id": "https://notmyjunie.github.io/blog/iemdecommissioning/",
			"url": "https://notmyjunie.github.io/blog/iemdecommissioning/",
			"title": "Decommissioning my old IEMs",
			"content_html": "<h1 id=\"story\" tabindex=\"-1\">Story <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h1>\n<p>I have used my pair of IEMs for 2 years and it has had its ups and downs throughout its lifetime of being used. To start off, I bought my <em>CCA CRA</em> in mid 2021 when my old headphones which are the <em>Razer Kraken X</em> broke apart exactly after 1 year of usage because of its lackluster build quality from Razer on cheap products. When I bought my IEMs I realized how good the sound quality is when compared to the Razer headphones while also being much cheaper than its counterpart.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://notmyjunie.github.io/img/PXLm6Vz8Q9-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://notmyjunie.github.io/img/PXLm6Vz8Q9-350.webp 350w\"><img alt=\"CCA CRA in question\" loading=\"lazy\" decoding=\"async\" src=\"https://notmyjunie.github.io/img/PXLm6Vz8Q9-350.jpeg\" width=\"350\" height=\"262\"></picture></p>\n<h2 id=\"before-iems\" tabindex=\"-1\">Before IEMs <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>Precursor to when I bought my IEMs, I used the Razer headphones because I had <em>ZERO</em> knowledge on buying good headsets and also because of it being cheap when compared to other gamer-y headsets from known brands. What I didn't know about Razer was their build quality on cheaper products tend to be horrible and I spent a good one year without knowing that. I still have the broken headphones hanging on my wall on display, makes a really good decoration on my wall.</p>\n<p>I logged on my usual chatroom and asked for earphone suggestions on there with a budget set in mind. One of the people there who is an audiophile mentioned to buy the <em>KZ x Crinacle CRN</em> but I told them it's not for sale where I'm at, and even then the ones sold in other shops cost a fortune. I asked them about buying other KZ IEMs but they told me not to buy them since the others around my price range are a hit or miss.</p>\n<p>When I looked for alternatives around my price range, I was intrigued when I saw a listing for a MYR75 (USD15) CCA CRA (the CRA+ wasn't released around that time). I did know what I was getting for the price and so I ordered it.</p>\n<h2 id=\"using-the-iems\" tabindex=\"-1\">Using the IEMs <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>The CCA CRA came with a translucent cable showing off the copper wires inside, I don't like how it looked when paired with the earpieces themselves. It also felt cheap and gets tangled a lot but I knew what I got for the price. I never did replace the cable with a different one because the audio quality could vary between cables.</p>\n<p>As for the earpiece covers themselves, I have to say it's just plastic with a cheap metal piece glued to give them more weight. It's just not aesthetically pleasing overall however I could roleplay as a racing driver putting on/off their earpiece cover with these. The molding of the plastic is typical to most IEMs you can find on the market.</p>\n<p>The box it came in also had three different sized ear plug sets and one set made of cushy foam. I used the foam plugs for a week until it started deteriorating. They fit my ears perfectly but because of this issue I had to use the original ones the IEMs came with. Since these aren't really noise-cancelling earphones I was surprised because the foam plugs cancels out outside sounds much better than the soft plastic(?) buds the earpieces came with.</p>\n<p>I can't comment much about the sound quality on these IEMs because I have only used one headphone and a lot of cheap earphones but if I had to, it sounds much much better than everything I've used before with the exception of a Sony earbuds. Once it had broken in, every song I've listened felt like it had more bass than the earphones I've had before. I would say these were great value for the time and even now, they are good IEMs to buy on a budget especially with how cheap they have become. One other pair of IEMs I had in mind was the Moondrop Chu which has better material but it has a non-replaceable cable so if it ever broke, I can't really do much other than buying another set of headsets.</p>\n<h2 id=\"one-year-of-usage\" tabindex=\"-1\">One year of usage <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>After using it for a year it started to have issues with one side sounding much louder than the other. Searching around for solutions on the internet, all I had to do was remove the protective piece of paper(?)/plastic(?) (I'm not too sure) protecting the internals of the IEMs from oil. It was said that earwax could block out the piece and I was sort of surprised as I never thought to clean the earpiece themselves. I do clean the plugs when it gets noticeably dirty from all the earwax. Once the piece was removed, my IEMs were much louder than with the piece on.</p>\n<p>Around a year and a half or so, the ear plug on one of the earpieces went missing and so I had to settle with the medium-sized ear plugs. They don't really fit my ear best and so I wore them less and lesser as days go by. It just lacks the ergonomics the old ones had.</p>\n<h2 id=\"when-it-broke\" tabindex=\"-1\">When it broke <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>I wouldn't say these IEMs broke, it's more of them being more unusable in it's lifetime. In September 2023, the left piece became less louder than it used to be. When I mess around with the audio jack the volume gets more different on the left side whereas on the right side it stayed the same. I initially assumed it had something to do with the cables so I ordered new cables(decently priced ones) but the issue persists.</p>\n<p>This was manageable up until when the left piece went silent when plugged into my phone(yes, my phone has a headphone jack, its 2023 wow would you believe that) and the sound on it never came back. Using it on a computer, I have had to do more janky tampering with the connector itself just to get the sound on the left side back on.</p>\n<p>This got more annoying and I had to use my old Sony earbuds for music on my phone instead. The CCA CRA was a good pair of IEMs I have used and I feel sad for having to leave these unused since it does its job well.</p>\n<h2 id=\"new-iems\" tabindex=\"-1\">New IEMs <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>Ever since my CCA CRA 'broke' I bought new IEMs to replace it which are the <em>TangZu WanEr</em> costing around the same as when I bought my old ones. I chose the jade green colour option and it looks really good in person and in picture. The packaging it came in is also super neat. I wanted the Moondrop Chu II originally since it has a more premium build quality but I settled for the WanEr instead because it has almost the same audio profile as the CCA CRA but a lot better.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://notmyjunie.github.io/img/g8k8bEoZeu-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://notmyjunie.github.io/img/g8k8bEoZeu-350.webp 350w\"><img alt=\"TangZu WanEr in jade green\" loading=\"lazy\" decoding=\"async\" src=\"https://notmyjunie.github.io/img/g8k8bEoZeu-350.jpeg\" width=\"350\" height=\"262\"></picture>\n<picture><source type=\"image/avif\" srcset=\"https://notmyjunie.github.io/img/6wpCCJd0yu-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://notmyjunie.github.io/img/6wpCCJd0yu-350.webp 350w\"><img alt=\"TangZu WanEr packaging\" loading=\"lazy\" decoding=\"async\" src=\"https://notmyjunie.github.io/img/6wpCCJd0yu-350.jpeg\" width=\"350\" height=\"466\"></picture></p>\n<h2 id=\"closing-off\" tabindex=\"-1\">Closing off <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/iemdecommissioning/\">#</a></h2>\n<p>In hindsight, I could've gone with a different headset instead of the Razer headphones that broke easily if I had done more research, but without those breaking I wouldn't get introduced to a whole different category of headsets that far surpasses the sound quality of the Razers.</p>\n",
			"date_published": "2024-04-11T00:00:00Z"
		}
		,
		{
			"id": "https://notmyjunie.github.io/blog/thinkpad-1week/",
			"url": "https://notmyjunie.github.io/blog/thinkpad-1week/",
			"title": "ThinkPad X1 Extreme, a week later",
			"content_html": "<h2 id=\"overview\" tabindex=\"-1\">Overview <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/thinkpad-1week/\">#</a></h2>\n<p>I've spent a week with my Lenovo ThinkPad X1 Extreme Gen 1 and it has been a really neat laptop. For starters, the ThinkPad line of laptops from Lenovo (originally from IBM) are known to be good business laptops used in corporate/enterprise settings. They are most known for being absolutely rugged and tough to the core with easily replaceable parts.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://notmyjunie.github.io/img/3GKBnGw9-7-350.avif 350w\"><source type=\"image/webp\" srcset=\"https://notmyjunie.github.io/img/3GKBnGw9-7-350.webp 350w\"><img alt=\"ThinkPad X1 Extreme Gen 1\" loading=\"lazy\" decoding=\"async\" src=\"https://notmyjunie.github.io/img/3GKBnGw9-7-350.jpeg\" width=\"350\" height=\"320\"></picture></p>\n<h2 id=\"cost-and-reasoning\" tabindex=\"-1\">Cost and Reasoning <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/thinkpad-1week/\">#</a></h2>\n<p>I bought my ThinkPad X1 Extreme which is refurbished for about <strong>$600</strong> which sounds alot when compared to the likes of a used T series laptop or even an older gen X1 Carbon. What must be considered when buying a used/refurbished ThinkPad is the selection of optional accessories included. Mine fortunately came with a fingerprint scanner and the ThinkShutter privacy feature for the webcam.</p>\n<p>The reason I chose this over the upgradeable T480 and the slim X1 Carbon is because of the <a href=\"https://psref.lenovo.com/syspool/Sys/PDF/ThinkPad/ThinkPad_X1_Extreme/ThinkPad_X1_Extreme_Spec.PDF\">specs</a> included. The ThinkPad X1 Extreme Gen 1 has a Kaby Lake Intel Core i7 included as its processor, which features an Intel UHD Graphics 630 as its internal GPU. Alongside an iGPU, this laptop also has an NVIDIA GeForce GTX1050 Ti (with Max-Q Design) as its dedicated GPU.</p>\n<p>My laptop was listed as 16GB RAM, however when I checked the specs of it once it arrived it turns out to have a 32GB RAM in it. I don't know whether this is on 1 RAM stick or 2 since I haven't open it up but, wow what a steal for this. There's also a 1TB SSD drive included.</p>\n<h2 id=\"okay-getting-back-to-the-topic\" tabindex=\"-1\">Okay, getting back to the topic <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/thinkpad-1week/\">#</a></h2>\n<p>I've been using this for a week now and it performs way better than one would expect of a laptop from 2018. Any task I do, it never fails. The ThinkPad runs smoothly in every application I've used. BIOS access and configurations was done easily, as expected from a Lenovo device. I can see myself using this laptop for years after college (assuming I use it conservatively).</p>\n<h2 id=\"the-flaws\" tabindex=\"-1\">The Flaws <a class=\"header-anchor\" href=\"https://notmyjunie.github.io/blog/thinkpad-1week/\">#</a></h2>\n<p>The keys near the TrackPoint(G/H/B) get weirdly clicky for some reason and I happen to stumble upon lots of trackpad drifting after using the TrackPoint.</p>\n",
			"date_published": "2024-03-25T00:00:00Z"
		}
		,
		{
			"id": "https://notmyjunie.github.io/blog/firstpost/",
			"url": "https://notmyjunie.github.io/blog/firstpost/",
			"title": "Site Revamp",
			"content_html": "<p>I have rewritten this site with the intent of making it compatible with md files for easier syntaxing. As of now, this site remains bare bones and not customised yet.</p>\n<p>This website was built with <a href=\"http://www.11ty.dev\" title=\"Eleventy\">Eleventy</a>, a really simple static site generator.</p>\n",
			"date_published": "2024-03-25T00:00:00Z"
		}
		
	]
}
